{
    "other": {
        "name": "W. Ross White"
    },
    "headers": {
        "about": "About",
        "experience": "Experience",
        "education": "Education",
        "skills": "Skills",
        "projects": "Projects",
        "interests": "Interests",
        "extras": "Extras",
        "social": "Social"
    },
    "about": {
        "zero": "Welcome to the online home of W. Ross White. I am a graduate of the Computer Systems Technology (CST) program Technical Programming option at the British Columbia Institute of technology (BCIT) in Burnaby, BC.  Today, I work at AlayaCare, a health care Software As A Service company focused on developing management systems for residential care facilities.  We are driven to enable the care we want our loved ones to receive in the place they call home.  Most recently I have been leading development on a feature which stops billing once a resident's fee cap limits have been reached.",
        "one": "The more development experience I get, the more I realize how much I still have to learn, but I welcome the challenge.  The more tools I add to my toolbox, the more I can do!  At AlayaCare I work with C# and AngularJS, and I have found that I really enjoy full stack web development, and look forward to learning new technologies as I progress in my career.",
        "two": "Thank you for visiting, I encourage you to poke around and check back again soon!",
        "first": "Ross",
        "last": "White",
        "city": "New Westminster, BC",
        "phone": "(604) 404-0002",
        "email": "wrosswhite@gmail.com"
    },
    "education": [
        {
            "ubc": {
                "id": 0,
                "name": "University of British Columbia - Okanagan",
                "degree": "Bachelor of Arts",
                "focus": "Psychology Major / Philosophy Minor",
                "date": "September 2010 - May 2012"
            },
            "bcit": {
                "id": 1,
                "name": "British Columbia Institute of Technology",
                "degree": "Computer Systems Technology Diploma",
                "focus": "Technical Programming Option",
                "date": "January 2018 - December 2019"
            }
        }
    ],
    "skills": {
        "skills": "Languages, Tools, & Skills",
        "more": "More About Me",
        "stack": "Full Stack Web Development",
        "mobile": "Mobile-First, Responsive Design",
        "cross": "Cross Browser Testing & Debugging",
        "agile": "Agile Development & Scrum",
        "oop": "Object Oriented Programming",
        "comms": "Stellar Communication Skills",
        "organized": "Meticulously Organized",
        "collaborator": "Excellent Collaborator",
        "zero": "I've been very happy with where I landed my first job.  AlayaCare is a Montreal based company who hired me through their Victoria office.  I'd basically given up the job search amidst the first pandemic lockdown when they messaged me out of the blue asking if I was still looking for work.  When they offered me a position I fell to the ground and laughed maniacally.",
        "one": "I have loved and appreciated so much landing a full stack development position out of the gate; I was worried about getting locked into something more specific and letting my other skills atrophe.  It has really been the perfect first job, the company is large enough that I am well supported, but still small enough to be agile and need people to reach and work up and down our stack.  I was also very luck to land a job where I was able to apply my .NET training from my BCIT Technical Programming focus.  I have also been very happy to learn a front end framework really well, but I wish it was something more modern than AngularJS, and I'm looking forward to helping with our migration to Vue.js.  I've been fortunate to work with great people at AlayaCare from whom I've learned so much.",
        "two": "Looking towards the future, it would be great to work in a field I have a more active interest in than health care, as gratifying it is to work on something that helps vulnerable people be taken care of.  I love gaming, but I'm pretty sure I don't want to work in game development.  Fields I would love to work in include blockchain technology, as a space nut I'd also love to work on satellites somehow.  This passion extends to robotics more generally, and post pandemic I plan to participate in a local hobby robotics club.  The dream job would definitely be working on NASA spacecraft.  Also, as a .NET/C# enthusiast it would be amazing to work at the Microsoft's offices here in Vancouver someday.",
        "three": "If you are a prospective employer checking me out, greetings! Feel free to look around! Although you've probably seen them already, please see below my cover letter and resume.",
        "languages": {
            "languages": "C# / Typescript / Javascript / Java",
            "markup": "HTML / CSS / Yaml",
            "environments": ".NET Framework / NodeJS / RESTful API",
            "database": "SQL / Entity Framework",
            "framework": "AngularJS / React / Vue / Bootstrap",
            "version": "GitHub",
            "services": "Docker / Azure" 
        }
    },
    "projects": {
        "newhorizonmission": {
            "name": "New Horizon Mission",
            "year": 2020,
            "tech": "HTML | JavaScript | Firebase | CSS | Bootstrap",
            "one": "This is just the site I created as my writing portfolio and general non professional landing page for myself.  The technology is not particularly modern, but I actively maintain it and am pleased with the retro aesthetic of it.",
            "two": "repo: https://github.com/williamrosswhite/newhorizonmission-html"
        },
        "qds20": {
            "name": "ConEx - BCIT QDS20 Big Data Hackathon",
            "year": 2020,
            "tech": "MVC | Node.js | JavaScript | MySQL | Pug | HTML | CSS",
            "one": "Over 20 hours I built a full MVC Node.js project to automate convention attendee tracking and analytic",
            "two": "deployment: https://qds-team5.herokuapp.com/ | repo: https://github.com/rwhite83/qds20-team5"
        },
        "final": {
            "name": "Final Countdown",
            "year": 2019,
            "tech": "MVC | Node.js | JavaScript | MySQL | Pug | HTML | CSS",
            "one": "As a student I wanted something to help organize work priority based on when things are due, so I built it!",
            "two": "deployment: www.finalcountdown.xyz | repo: https://github.com/rwhite83/final-countdown"
        },
        "floral": {
            "name": "Floral Trauma",
            "year": 2019,
            "tech": "C# | Unity | PUN | Visual Studio | ASP.NET | Node.js | JavaScript",
            "one": "Project Lead on a 24-student game development project.  Organized teams / development sprints and built website",
            "two": "website deployment: http://floral-trauma-mmst.herokuapp.com/"
        },
        "disaster": {
            "name": "Disaster Pets",
            "year": 2019,
            "tech": "Firebase | JavaScript | NoSQL | HTML | CSS",
            "one": "Industry project involving registering pets left behind in disaster zones so emergency responders can rescue them",
            "two": "deployment: https://disaster-pets.firebaseapp.com/"
        },
        "fiona": {
            "name": "F.I.O.N.A. (File and Information Online Network Access",
            "year": 2020,
            "tech": "C# | Visual Studio | SQL Server",
            "one": "Led team of 3 to develop a user friendly 'FileZilla my mother could use' with server and client classes",
            "two": "repo: https://github.com/rwhite83/CSharp-F.I.O.N.A"
        },
        "life": {
            "name": "Game of Life",
            "year": 2020,
            "tech": "Java | OOP | Eclipse",
            "one": "Java OOP Project to simulate carnivore/omnivore/herbivore/plant interaction ",
            "two": ""
        }
    }
}